In [1]:
# Dependencies
import pandas as pd
import numpy as np

In [2]:
# Save path to data set in a variable
data_file = "C:\\Users\\taiwo\\OneDrive\\Desktop\\PREWORK_TO\\Module 4\\Resources\\purchase_data.csv"

In [3]:
# Use Pandas to read data
data_file_pd = pd.read_csv(data_file)
data_file_pd.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [4]:
# Display a statistical overview of the DataFrame
data_file_pd.describe()

       Purchase ID         Age     Item ID       Price
count   780.000000  780.000000  780.000000  780.000000
mean    389.500000   22.714103   92.114103    3.050987
std     225.310896    6.659444   52.775943    1.169549
min       0.000000    7.000000    0.000000    1.000000
25%     194.750000   20.000000   48.000000    1.980000
50%     389.500000   22.000000   93.000000    3.150000
75%     584.250000   25.000000  139.000000    4.080000
max     779.000000   45.000000  183.000000    4.990000

In [137]:
# The total number of players
count_players = data_file_pd["SN"].nunique()
count_players

576

In [138]:
# The total number of unique items
unique_items = data_file_pd["Item ID"].nunique()
unique_items

183

In [139]:
# The average purchase price
average_price = data_file_pd["Price"].mean()
average_price

3.0509871794871795

In [140]:
# The total number of purchases
no_items = data_file_pd["SN"].count()
no_items

780

In [141]:
# Total Revenue
revenue = data_file_pd["Price"].sum()
revenue

2379.77

In [142]:
Quick_Summary = pd.DataFrame(
    {"Total_No_Of_Players": (count_players),
     "Unique_Items": (unique_items),
     "Average_Price": (average_price),
     "Total_No_Of_Purchases": (no_items),
     "Total_Revenue": [revenue]})

Quick_Summary

,Total_No_Of_Players,Unique_Items,Average_Price,Total_No_Of_Purchases,Total_Revenue
0,576,183,3.050987,780,2379.77

In [143]:
# Count By Gender
count_by_gender = data_file_pd["Gender"].value_counts()
count_by_gender

Male                     652
Female                   113
Other / Non-Disclosed     15
Name: Gender, dtype: int64

In [144]:
# Percentage by gender
Percentage_by_gender = data_file_pd["Gender"].value_counts(max)*100
Percentage_by_gender

Male                     83.589744
Female                   14.487179
Other / Non-Disclosed     1.923077
Name: Gender, dtype: float64

In [97]:
# Using GroupBy in order to separate the data into fields according to "Gender" values
grouped_gender_df = data_file_pd.groupby(['Gender'])

# The object returned is a "GroupBy" object and cannot be viewed normally...
print(grouped_gender_df)

# In order to be visualized, a data function must be used...
grouped_gender_df.count()

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000001CDD2DE6390>

                       Purchase ID   SN  Age  Item ID  Item Name  Price
Gender
Female                         113  113  113      113        113    113
Male                           652  652  652      652        652    652
Other / Non-Disclosed           15   15   15       15         15     15

In [114]:
Average_purchase_price = grouped_gender_df[["Price"]].mean()
Average_purchase_price

                          Price
Gender
Female                 3.203009
Male                   3.017853
Other / Non-Disclosed  3.346000

In [145]:
Total_purchase_value = grouped_gender_df[["Price"]].sum()
Total_purchase_value

                         Price
Gender
Female                  361.94
Male                   1967.64
Other / Non-Disclosed    50.19

In [110]:
Purchase_count = grouped_gender_df[["Price"]].count()
Purchase_count

                       Price
Gender
Female                   113
Male                     652
Other / Non-Disclosed     15

In [149]:
#Unique Persons by Gender
UPG = grouped_gender_df[["SN"]].nunique()
UPG

                        SN
Gender
Female                  81
Male                   484
Other / Non-Disclosed   11

In [179]:
#Average Purchase Total per Person by Gender
APG = (Total_purchase_value.div(UPG))
APG

                       Price  SN
Gender
Female                   NaN NaN
Male                     NaN NaN
Other / Non-Disclosed    NaN NaN

In [126]:
Summary_purchasing_analysis = pd.merge(Total_purchase_value,Average_purchase_price, on="Gender", how="outer")
Summary_purchasing_analysis

                       Price_x   Price_y
Gender
Female                  361.94  3.203009
Male                   1967.64  3.017853
Other / Non-Disclosed    50.19  3.346000

In [180]:
Summary_purchasing_analysis2 = pd.concat([Purchase_count, Total_purchase_value, Average_purchase_price]).round(2)
Summary_purchasing_analysis2

                         Price
Gender
Female                  113.00
Male                    652.00
Other / Non-Disclosed    15.00
Female                  361.94
Male                   1967.64
Other / Non-Disclosed    50.19
Female                    3.20
Male                      3.02
Other / Non-Disclosed     3.35

In [182]:
# Create bins in which to place values based upon age groups of players
bins = [0, 10, 15, 20, 25, 30, 35, 40, 50]

# Create labels for these bins
group_labels = ["0 to 10", "11 to 15", "16 to 20" , "21 to 25" , "26 to 30" , "31 to 35" , "36 to 40" ,
                "41 to 50"]
# Slice the data and place it into bins
pd.cut(data_file_pd["Age"], bins, labels=group_labels).head()

0    16 to 20
1    36 to 40
2    21 to 25
3    21 to 25
4    21 to 25
Name: Age, dtype: category
Categories (8, object): [0 to 10 < 11 to 15 < 16 to 20 < 21 to 25 < 26 to 30 < 31 to 35 < 36 to 40 < 41 to 50]

In [185]:
# Place the data series into a new column inside of the DataFrame
data_file_pd["Age Group"] = pd.cut(data_file_pd["Age"], bins, labels=group_labels)
data_file_pd.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Group
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,16 to 20
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,36 to 40
2,2,Ithergue48,24,Male,92,Final Critic,4.88,21 to 25
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,21 to 25
4,4,Iskosia90,23,Male,131,Fury,1.44,21 to 25

In [188]:
# Create a GroupBy object based upon "Age Group"
Pymoli_group = data_file_pd.groupby("Age Group")

# Purchase Count per Bin
Pymoli_group_count = (Pymoli_group["Item ID"].count())
Pymoli_group_count

Age Group
0 to 10      32
11 to 15     54
16 to 20    200
21 to 25    325
26 to 30     77
31 to 35     52
36 to 40     33
41 to 50      7
Name: Item ID, dtype: int64

In [211]:
#Percentage Count of players per Age Group
Pymoli_group_percentage = ((Pymoli_group["Item ID"].count())*0.128205)
Pymoli_group_percentage

Age Group
0 to 10      4.102560
11 to 15     6.923070
16 to 20    25.641000
21 to 25    41.666625
26 to 30     9.871785
31 to 35     6.666660
36 to 40     4.230765
41 to 50     0.897435
Name: Item ID, dtype: float64

In [189]:
# Average Purchase Price per Bin
Pymoli_group_mean = Pymoli_group[["Price"]].mean()
Pymoli_group_mean

              Price
Age Group
0 to 10    3.405000
11 to 15   2.900000
16 to 20   3.107800
21 to 25   3.020431
26 to 30   2.875584
31 to 35   2.994423
36 to 40   3.404545
41 to 50   3.075714

In [190]:
# Total Purchase Price per Bin
Pymoli_group_sum = Pymoli_group[["Price"]].sum()
Pymoli_group_sum

            Price
Age Group
0 to 10    108.96
11 to 15   156.60
16 to 20   621.56
21 to 25   981.64
26 to 30   221.42
31 to 35   155.71
36 to 40   112.35
41 to 50    21.53

In [191]:
# Purchase Count per person per Bin
Pymoli_group_upcount = (Pymoli_group["SN"].nunique())
Pymoli_group_upcount

Age Group
0 to 10      24
11 to 15     41
16 to 20    150
21 to 25    232
26 to 30     59
31 to 35     37
36 to 40     26
41 to 50      7
Name: SN, dtype: int64

In [195]:
#Average Purchase Total per Person by Age Group/Bin
Pymoli_group_upmean = (Pymoli_group_sum)/(Pymoli_group_upcount)
Pymoli_group_upmean

,0 to 10,11 to 15,16 to 20,21 to 25,26 to 30,31 to 35,36 to 40,41 to 50,Price
Age Group,,,,,,,,,
0 to 10,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
11 to 15,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
16 to 20,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
21 to 25,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
26 to 30,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
31 to 35,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
36 to 40,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
41 to 50,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN